Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: This silk feels smooth.
hi: यह रेशम छूने में बहुत नर्म लगता है।

source: How clever this dog is!
hi: कितना होशियार कुत्ता है!

source: Do you have these shoes in my size?
hi: क्या ये जूते मेरे नाप में भी हैं?

source: What do you call this fish in English?
hi: इस मछली को अंग्रेज़ी में क्या कहते हैं?

source: This rule applies to you, too.
hi: यह नियम तुमपर भी लागु होता है।

source: Food goes bad easily in this season.
hi: इस मौसम में खाना आसानी से खराब हो जाता है।

source: This machine is driven by electricity.
hi: यह मशीन बिजली से चलती है।

source: This machine is superior in quality to that one.
hi: यह मशीन उस मशीन से बेहतर है।

source: Take care not to throw away this chance.
hi: देखो कि इस मौके को न गवा बैठो।

source: This desk is made of wood.
hi: यह मेज़ लकड़ी की बनी है।

source: I can't put up with this cold.
hi: मुझसे यह ठंड सही नहीं जाएगी।

source: This amount includes tax.
hi: इस कीमत में टैक्स शामिल है।

source: This school has many students.
hi: इस स्कूल में बहुत सारे विद्यार्थी हैं।

source: This picture is of my uncle.
hi: यह तसवीर मेरे चाचा की है।

source: Are you a member of this society?
hi: क्या आप इस समिति के सदस्य हैं?

source: This song always reminds me of my childhood.
hi: यह गाना हमेशा मुझे मेरे बचपन की याद दिलाता है।

source: Can you sing this song?
hi: क्या तुम यह गाना गा सकते हो?

source: This song is very popular in Japan.
hi: यह गाना जापान में बहुत लोकप्रिय है।

source: This song makes me happy.
hi: यह गाना सुन कर में ख़ुश हो जाता हूँ।

source: This song is known to everyone.
hi: यह गाना सभी को पता है।

source: This song was written by Foster.
hi: यह गाना फ़ॉस्टर ने लिखा था।

source: This song's name is "Only You".
hi: इस गाने का नाम हे "बस तुम"।

source: This house has six rooms.
hi: इस घर में छः कमरे हैं।

source: This house has eleven rooms.
hi: इस मकान में ग्यारह कमरे हैं।

source: I swam a lot during this summer vacation.
hi: मैंने इस साल गर्मी की छुट्टियों में बहुत तैरा।

source: The English of this composition is too good.
hi: इस लेख की अंग्रेज़ी बहुत ही अच्छी है।

source: Going out in this rain is out of the question.
hi: इस बारिश में बाहर जाना एकदम सवाल के बाहर है।

source: Taste this wine to see if you like it.
hi: यह वाईन चखकर देखो तुम्हें अच्छी लगती है कि नहीं।

source: This apple tastes sour, doesn't it?
hi: यह सेव खट्टा है ना?

source: This lion is very tame.
hi: यह शेर बहुत पालतू है।

source: You ought to do away with this practice.
hi: तुम्हे इस आदत को छोड़ देना चाहिए।

source: This present was given to me by Ann.
hi: यह भेंट मुझे ऐन ने दी थी।

source: These grapes are so sour that I can't eat them.
hi: ये अंगूर इतने खट्टे हैं कि मुझसे खाए नहीं जा रहे।

source: Blow your nose with this handkerchief.
hi: नाक इस रुमाल में झाड़ो।

source: Is the mouse dead or alive?
hi: चूहा ज़िन्दा है या मर गया है?

source: This tie doesn't go with my suit.
hi: यह टाई मेरे सूट के साथ जचती नहीं है।

source: The knife is not sharp.
hi: यह चाकू तेज़ नहीं है।

source: Wipe your hands with this towel.
hi: अपने हाथ इस तौलिए से पोंछो।

source: Is this diamond real?
hi: क्या यह हीरा असली है?

source: Will you exchange this sweater for a larger one?
hi: आप यह स्वेटर बड़े नाप वाले के लिए बदल देंगे क्या?

source: This soup smacks of fish.
hi: इस सूप में मछली का स्वाद है।

source: I don't like this jacket.
hi: मुझे यह जैकेट पसंद नहीं है।

source: The sheets feel damp.
hi: चादरें गीलीं लगतीं हैं।

source: This coffee is so hot that I can't drink it.
hi: यह कॉफ़ी इतनी गरम है कि मुझसे पी नहीं जा रही है।

source: There are fifty members in this club.
hi: इस सभा में पचास सदस्य हैं।

source: The cup is made of gold.
hi: प्याला सोने का बना है।

source: This tea is called green tea.
hi: इस चाय को हरी चाय कहते हैं।

source: Please change this bill into coins.
hi: इस नोट को सिक्कों में बदल दीजिए।

source: What are you going to do with this money?
hi: तुम इन पैसों के साथ क्या करोगे?

source: This elevator does not go above the sixth floor.
hi: यह लिफ़्ट छटी मंज़िल तक ही जाती है।

source: Please bring me some glasses.
hi: कृपया मुझे चश्मा ला दीजिये.

source: This is Tom speaking. I'd like to speak to Ann.
hi: मैं टॉम बोल रहा हूँ। मुझे ऐन से बात करनी है।

source: Here is your key.
hi: यह रही तुम्हारी चाबी।

source: It's been pouring here for the last few days.
hi: यहाँ पिछले कुछ दिनों से दबाकर बारिश हो रही है।

source: This is a hospital.
hi: यह अस्पताल है।

source: It's very hot here.
hi: यहाँ बहुत गरम है।

source: Are you going to cut down all the trees here?
hi: तुम यहाँ सारे के सारे पेड़ काट डालोगे क्या?

source: You cannot park your car here.
hi: आप अपनी गाड़ी यहाँ खड़ी नहीं कर सकते।

source: Twenty families live here.
hi: यहाँ बीस परिवार बसे हुए हैं।

source: Could you sign here?
hi: यहाँ हस्ताक्षर कर सकते हैं क्या?

source: You are not supposed to play baseball here.
hi: यहाँ बेसबॉल खेलना मना है।

source: Let's meet here again tomorrow.
hi: यहाँ पर कल फिर मिलते हैं।

source: What would you do if you met a lion here?
hi: अगर यहां तुम्हें शेर मिला तो तुम क्या करोगे?

source: Smoking is not allowed here.
hi: यहाँ धूम्रपान करना मना है।

source: Articles bought here will be delivered free of charge.
hi: यहाँ खरीदीं हुईं चीज़ों को मुफ़्त में घर तक पहुँचाया जाएगा।

source: We can hear the ocean from here.
hi: हमे यहाँ से समुंदर सुनाई देता है।

source: The coffee bubbled in the pot.
hi: कौढ़ी केतली में उबल रही थी।

source: A button has come off my coat.
hi: मेरे कोट से एक बट्टन टूट गया है।

source: You find koalas in Australia.
hi: ऑस्ट्रेलिया में कोआला मिलते हैं।

source: Ken is happy.
hi: केन खुश है।

source: Ken beat me at chess.
hi: केन ने मुझे शतरंज में हरा दिया।

source: Ken's turn came.
hi: केन की बारी आई।

source: You cannot eat your cake and have it too.
hi: तुम "चित भी मेरी पट भी मेरी" नहीं कर सकते।

source: There were two cakes. I ate one and then I ate the other.
hi: दो केक थे। मैंने एक खाया और फिर मैंने दूसरा खाया।

source: Kate has a cold.
hi: केट को ज़ुकाम है।

source: Kate has been given an opportunity to play a major role in a movie.
hi: केट को एक फ़िल्म में प्रमुख भूमिका निभाने का मौका दिया गया गै।

source: Hasn't Kate arrived yet?
hi: केट अभी तक आई नहीं है?

source: Kate was surprised by Brian's story.
hi: ब्रायन की कहानी सुन कर केट चौक गई।

source: Kate wants to finish her homework by ten.
hi: केट को अपना होमवर्क दस बजे तक ख़तम करना है।

source: You must observe the rules of the club.
hi: तुम्हे क्लब के नियमों का पालन करना होगा।

source: Don't speak ill of your classmates.
hi: अपने सहपाठियों की बुराई मत करो।

source: Classical music is not my cup of tea.
hi: मुझे शास्त्रीय संगीत सुनने का शौक नहीं है।

source: Christianity and Islam are two different religions.
hi: ईसाईयत और इस्लाम दो अलग-अलग धर्म हैं।

source: The Greeks used to worship several gods.
hi: यूनानी कई देवों की पूजा करते थे।

source: Greeks often eat fish, too.
hi: ग्रीक लोग भी अक्सर मछली खाते हैं।

source: On no account must you go out today.
hi: तुम किसी भी हालत में आज बाहर नहीं जा सकते।

source: How many brothers and sisters do you have?
hi: आपके कितने भाई और बहनें हैं?

source: Carol has been studying Spanish for three years.
hi: कैरल तीन साल से स्पैनिश पढ़ रही है।

source: I heard that Carol and Will have split up.
hi: मैंने सुना है कि कैरल और विल अब एक साथ नहीं हैं।

source: Did Cathy go, too?
hi: क्या कैथी भी गई थी?

source: You look tired.
hi: तुम थके-हारे से लगते हो।

source: Your cough is the consequence of smoking.
hi: तुम्हारी खाँसी तुम्हारे सिगरेट पीने की वजह से है।

source: Until yesterday, I had known nothing about it.
hi: मुझे कल तक इसके बारे में कुछ भी नहीं पता था।

source: I slept all day yesterday, because it was Sunday.
hi: कल रविवार था, तो मैं पूरे दिन सोते रहा।

source: A fox is a wild animal.
hi: लोमड़ी जंगली जानवर होती है।

source: He must love you.
hi: वह तुमसे प्यार करता होगा।

source: I want a guitar.
hi: मुझे गिटार चाहिए।

source: A man named Carlos came to a mountain village looking for that old man.
hi: कार्लोस नाम का एक आदमी किसी पहाड़ी गांव में उस बूढे आदमी की तलाश में आया।

source: Glass is made from sand.
hi: ग्लास रेत से बनाया जाता है।

source: They looked at the rubbish, then they looked at each other.
hi: उन्होंने पहले कचरे की तरफ, और फिर एक दुसरे की तरफ देखा.

source: Is there a cafe?
hi: यहाँ कैफ़े है क्या?

source: Canada is larger than Japan.
hi: कनाडा जापान से बड़ा है।

source: French is spoken in a part of Canada.
hi: फ़्रांसीसी कनाडा के एक हिस्से में बोली जाती है।

source: Have you ever been to Canada?
hi: तुम कभी कनाडा गए हो क्या?

source: What languages do they speak in Canada?
hi: कनाडा में कौनसी भाषाएं बोली जाती हैं?

source: They speak English and French in Canada.
hi: कनाडा में अंग्रेज़ी और फ़्रांसीसी बोली जातीं है।

source: There used to be a bridge here.
hi: यहां एक पुल हुआ करता था।

source: Have you ever seen a cuckoo?
hi: कभी कोयल देखी है?

source: Take this medicine when you have a cold.
hi: ज़ुकाम हो तो यह दवाई ले लेना।

source: Do you cook by gas or electricity?
hi: तुम बिजली से खाना पकाती हो या गैस से?

source: That's Carl.
hi: वह कार्ल है।

source: I wish I had more time to talk with you.
hi: काश मेरे पास और समय होता तुम्हारे साथ बात करने के लिए।

source: Can we have a talk?
hi: हम बात कर सकते हैं क्या?

source: I wish I could help you.
hi: काश मैं तुम्हारी मदद कर सकता।

source: I have no time to see you.
hi: मेरे पास तुमसे मिलने के लिए समय नहीं है।

source: Please tell me your name and telephone number.
hi: मुझे अपना नाम और फ़ोन नम्बर बताईये।

source: During Obon there is much confusion at train stations.
hi: ओबोन के समय में रेल स्टेशनों पर भागा-दौड़ी मची रहती है।

source: Mom scolded me for making fun of them.
hi: माँ ने मेरे उनका मज़ाक उड़ाने के लिए डाँट लगाई।

source: Where is mother?
hi: माँ कहाँ है?

source: Mom, add a little more salt to the soup.
hi: मम्मी, सूप में थोड़ा और नमक डालो।

source: My stomach is growling.
hi: मेरा पेट गुड़गुड़ा रहा है।

source: Where is Father?
hi: पिताजी कहाँ हैं?

source: Dad is shaving in the bathroom.
hi: पापा बाथरूम में दाढ़ी बना रहे हैं।

source: You two look exactly like brother and sister.
hi: आप दोनों बिलकुल भाई-बहन लगते हो।

source: The hot water isn't running.
hi: गरम पानी नहीं चल रहा है।

source: Leave it to me to prepare lunch.
hi: खाना बनाना मुझपर छोड़ दो।

source: I'll make tea for you.
hi: मैं तुम्हारे लिये चाय बनाता हूँ।

source: Please give me a cup of tea.
hi: मुझे एक कप चाय दीजिए।

source: Would you like another cup of tea?
hi: आप एक और कप चाय पीना चाहेंगे क्या?

source: Happy birthday to you!
hi: जन्मदिन मुबारक हो!

source: Your dog is very big.
hi: तुम्हारा कुत्ता बहुत बड़ा है।

source: Let me take you home.
hi: मुझे तुम्हें घर लेजाने दो।

source: Please hang on. I'll put him on the phone.
hi: थोड़ी देर ठहरिए। मैं उन्हें फ़ोन देता हूँ।

source: Take care of yourself.
hi: अपना ख़याल रखना।

source: This accident has nothing to do with me, officer.
hi: इस दुर्घटना का मुझसे कोई लेना-देना नहीं है, ऑफिसर।

source: I am sorry if I disturbed you.
hi: माफ़ कीजिएगा अगर मैंने आपको परेशान किया तो।

source: Where is your cap?
hi: आपकी टोपी कहाँ है?

source: Sit wherever you like.
hi: कहीं भी बैठ जाओ।

source: Let's try to understand one another.
hi: एक-दूसरे को समझने की कोशिश करते हैं।

source: Can we effect a compromise?
hi: हम कोई समझौता कर सकतें हैं क्या?

source: My money was stolen.
hi: मेरे पैसे चोरी हो गए।

source: Will you lend me some money?
hi: क्या तुम मुझे कुछ पैसे उधार दोगे?

source: Is it possible to borrow money?
hi: क्या पैसे उधार लिए जा सकते हैं?

source: I want money.
hi: मुझे पैसा चाहिए।

source: I'm very happy to make your acquaintance.
hi: मुझे आपसे मिलकर बहुत खुशी हुई।

source: We had no customers, so we shut the shop early.
hi: हमारे पास ग्राहक नहीं थे, तो हमने दुकान जल्दी बंद करदी।

source: You are under arrest.
hi: तुम्हें गिरफ्तार किया जाता है।

source: I have a stomachache.
hi: मुझे पेट में दर्द हो रहा है।

source: If you are hungry, you can eat the bread.
hi: अगर भूख लगी है तो ब्रेड खा सकते हो।

source: Could you bring me another hot towel?
hi: मेरे लिए एक और गरम तौलिया ला सकते हैं क्या?

source: My uncle lives in Madrid, the capital of Spain.
hi: मेरे चाचा स्पेन की राजधानी मेड्रिड में रहते हैं।

source: I got an old Toyota from my uncle.
hi: मुझे मेरे चाचा से एक पुरानी टोयोटा मिली।

source: Where in Austria did you grow up?
hi: ऑस्ट्रिया में तुम कहां बड़ी हुई?

source: Australia exports a lot of wool.
hi: ऑस्ट्रेलिया ऊन का बड़ी मात्रा में निर्यात करता है।

source: English is spoken in Australia.
hi: आस्ट्रेलिया में अंग्रेजी बोली जाती है।

source: Hey you, shut up!
hi: तुम चुप करो!

source: Write your name with the pencil.
hi: पेन्सिल से अपना नाम लिख।

source: What's the height of the Empire State Building?
hi: एम्पायर स्टेट बिल्डिंग की ऊँचाई कितनी है?

source: Where is the elevator?
hi: लिफ़्ट कहाँ पर है?

source: Mt. Everest is the highest peak in the world.
hi: एवरेस्ट पर्वत दुनिया का सबसे ऊँचा पर्वत शिखर है।

source: The rumor proved to be an absolute lie.
hi: वह अफ़वाह एकदम झूठी निकली।

source: Let's cut down our expenses.
hi: हमें अपने खर्चे कम करने होंगे।

source: Everything is all right at home.
hi: घर में सब-कुछ ठीक है।

source: Is it always a sin to tell a lie?
hi: क्या झूठ हमेशा बुरा होता है?

source: A rabbit has long ears.
hi: खरगोश के कान लम्बे होते हैं।

source: Whiskey goes very well with tea.
hi: चाय के साथ व्हिस्की अच्छी लगती है।

source: I ran out of money during my stay in India.
hi: भारत में रहने के दौरान मेरे पास पैसे खतम हो गए।

source: India was governed by Great Britain for many years.
hi: भारत पर बहुत सालों तक ग्रेट ब्रिटेन राज करता था।

source: India was subject to the British Empire.
hi: भारत ब्रिटिज राज के शासन में था।

source: India is the seventh largest country in the world.
hi: भारत विश्व में सातवाँ सबसे बड़ा देश है।

source: India is populous.
hi: भारत घनी आबादी वाला देश है।

source: India is now short of food.
hi: भारत में अभी अनाज की कमी है।

source: What is the population of India?
hi: भारत की आबादी क्या है?

source: India gained independence from Britain in 1947.
hi: भारत को ब्रिटेन से १९४७ में स्वतंत्रता प्राप्त हुई।

source: India has a different climate from England.
hi: भारत का मौसम इंग्लैड के मौसम से एकसमान नहीं है।

source: Cows are sacred to many people in India.
hi: भारत में कई लोग गाय को पूज्य मानते हैं।

source: Have you ever been to India?
hi: तुम कभी भारत गए हो क्या?

source: In India, the cow is a sacred animal.
hi: भारत में गाय को पूज्य माना जाता है।

source: Must I write in ink?
hi: मुझे स्याही से ही लिखना होगा?

source: My pen has run out of ink! Can I borrow your pen?
hi: मेरी कलम में स्याही खतम हो गई है। मैं तुम्हारी कलम ले सकता हूँ क्या?

source: The government of the Inca Empire controlled everything.
hi: इनका साम्राज्य की सरकार सब कुछ नियंत्रित करती थी।

source: He was the ruler of the Inca Empire.
hi: वह इनका साम्राज्य के शासक थे।

source: I don't believe him at all.
hi: मैं उसका बिलकुल भी यकीन नहीं करता।

source: If you do anything at all, do it well.
hi: अगर कुछ करना है तो ढंग से करो।

source: The dog barked furiously, which awakened my brother.
hi: कुत्ते ने ज़ोर लगाकर भौंका, जिससे मेरे भाई की नींद खुल गई।

source: When are you coming back?
hi: तुम वापस कब आओगे?

source: When did you see her?
hi: तुमने उसे कब देखा था?

source: When will you get ready to leave?
hi: तुम चलने के लिए तैयार कब होगे?

source: When do you want to go?
hi: तुम कब जाना चाहते हो?

source: When did you get back from London?
hi: तुम लंदन से कब वापस आए?

source: When are you going to Europe?
hi: तुम यूरोप कब जा रहे हो?

source: What do you usually do after dinner?
hi: तुम आमतौर पर रात में खाना खाने के बाद क्या करते हो?

source: Always keep your office tidy.
hi: अपने दफ़्तर को हमेशा साफ़-सुथरा रखना चाहिए।

source: I arrived later than usual.
hi: मैं आमतौर के मुकाबले में देर से आया।

source: There is always something to do.
hi: करने के लिए हमेशा कुछ-न-कुछ तो होता ही है।

source: When do you play tennis?
hi: तुम टेनिस कब खेलना चाहते हो?

source: Can anyone believe you?
hi: क्या कोई तुम्हारा यकीन कर सकता है?

source: Can you tell me when to switch the machine off?
hi: क्या मुझे बता सकते हो कि मशीन को कब बंद करना है?

source: Someday your dream will come true.
hi: तुम्हारा सपना एक दिन सच हो जाएगा।

source: Some day we'll take a trip to India.
hi: हम एक दिन भारत का सफ़र करने जाएंगे।

source: I want to go to America some day.
hi: मैं एक दिन अमेरिका जाना चाहता हूँ।

source: The capital of Italy is Rome.
hi: इटली की राजधानी रोम है।

source: Mischief is common to most children.
hi: लगभग सभी बच्चे नटखट होते हैं।

source: Shall I get you a chair?
hi: मैं आपके लिए कुरसी लेआऊँ?

source: May I ask some questions?
hi: क्या में थोड़े सवाल पूछ सकता हूं?

source: Who is the greatest poet in England?
hi: इंग्लैंड में सबसे महान कवि कौन है?

source: The voyage from England to India used to take 6 months.
hi: इंग्लैड से भारत तक का सफ़र छः महीनों का हुआ करता था।

source: We have good news.
hi: हमारे पास खुशखबर है।

source: A good idea entered my mind.
hi: मेरे दिमाग़ में एक अच्छी तरक़ीब सूझी है।

source: I'm getting happy.
hi: मैं खुश हो रहा हूँ।

source: You see, I left school when I was thirteen.
hi: बात यह है के मैने तेरा साल की उम्र में ही पाठशाला छोड़ दी।

source: Happy Easter!
hi: एसटर मुबारक हो!

source: No, it cannot be true.
hi: नहीं, यह सच नहीं हो सकता।

source: No, I don't think that I am to blame.
hi: नहीं, मुझे नहीं लगता कि ग़लती मेरी है।

source: Ann often plays tennis after school.
hi: ऐन अक्सर स्कूल के बाद टेनिस खेलने जाती है।

source: Ann is a little girl.
hi: अॅन छोटी लड़की है।

source: I can't bear the sight of him.
hi: मुझे उसको देखा नहीं जाता।

source: You are fortunate to have such loving parents.
hi: तुम नसीब वालो हो जिसके इतना प्यार करने वाले माँ-बाप हैं।

source: That is his house.
hi: वह उसका घर है।

source: That is not a horse, but a donkey.
hi: वह घोड़ा नहीं, वह तो गधा है।

source: This is my dog.
hi: यह मेरा कुत्ता है।

source: That was my mistake.
hi: वह मेरी ग़लती थी।

source: That's our house.
hi: वह हमारा घर है।

source: What's that bird?
hi: वह कौनसी चिड़िया है?

source: What is the name of that river?
hi: उस नदी का नाम क्या है?

source: Is that a cat?
hi: वह बिल्ली है क्या?

source: That is not a tiger.
hi: वह बाघ नहीं है।

source: That is mine.
hi: वह मेरा है।

source: One day he helped a weak turtle.
hi: उसने एक दिन एक कमज़ोर कछुए की मदद करी।

source: Don't drink any alcohol.
hi: शराब की एक बूंद भी मत पियो।

source: Alice smiled.
hi: ऐलिस मुस्कुरायी।

source: Americans participate in most sports.
hi: अम्रीकी लोग ज़्यादातर खेलों में भाग लेते हैं।

source: When did America become independent of England?
hi: अम्रीका को इंग्लैंड से आज़ादी कब मिली?

source: The urban population of America is increasing.
hi: अमरीका की शहरी लोकसंख्या बढ़ रही है।

source: You have to cross the ocean to get to America.
hi: अमरीका पहुँचने के लिये महासागर पार करना पड़ता है।

source: Why do you think soccer isn't popular in the US?
hi: तुम्हारे खयाल से अम्रीका में फ़ुटबॉल लोकप्रिय क्यों नहीं है?

source: I do not have much time.
hi: मेरे पास ज़्यादा समय नहीं है।

source: Africa was once called the Dark Continent.
hi: अफ़्रीका को एक समय में अंधेर महाद्वीप बुलाया जाता था।

source: Have you ever been to Africa?
hi: तुम कभी अफ़्रीका गए हुए हो क्या?

source: That book is worth reading.
hi: वह किताब पढ़ने लायक़ है।

source: That lady appears rich.
hi: वह औरत पैसेवाली लगती है।

source: That box is bigger than this one.
hi: वह डब्बा इस वाले से बड़ा है।

source: There was a strong wind that day.
hi: उस दिन हवा बहुत तेज़ थी।

source: What he lacks is courage.
hi: उसको बहादुरी की ज़रूरत है।

source: He doesn't have long to live.
hi: उसके पास जीने के लिए ज़्यादा समय नहीं है।

source: The top of that mountain is flat.
hi: उस पहाड़ की चोटी चपटी है।

source: Look at those black clouds.
hi: उन काले बादलों को तो देखो।

source: That black one is mine.
hi: वह काला वाला मेरा है।

source: I regret not having bought that house.
hi: मुझे उस घर को न खरीदने का पछतावा हो रहा है।

source: The house is haunted.
hi: इस घर में भूत है।

source: You should have seen the movie.
hi: तुम्हें फ़िल्म देखनी चहिए थी।

source: Seeing that movie is something like taking a trip to India.
hi: उस फ़िल्म को देखना भारत के सफ़र पर जाने जैसा है।

source: The love letter ought to have reached her.
hi: वह प्रेम पत्र उसतक पहुँच जाना चाहिए था।

source: If you go to that supermarket, you can buy most things you use in your daily life.
hi: उस सूपरमार्केट में तुम लगभग कोई भी रोजाने में इस्तेमाल होने वाला सामान ख़रीद सकते हो।

source: You must have such friends as will help you.
hi: तुम्हारे ऐसे दोस्त होने चाहिए के जो तुम्हारी मदद करें।

source: I'm thinking of taking you to see Mr Jenkins.
hi: मैं सोच रहा हूँ कि तुम्हें जेनकिन्स-जी से मिलवाने ले जाऊँ।

source: Will you go to America next month?
hi: तुम अगले महीने अम्रीका जाओगे क्या?

source: You must not play.
hi: तुम्हें खेलना नहीं चाहिए।

source: Are your eyes bad?
hi: तुम्हारी आँखे खराब हैं क्या?

source: Are you reading an interesting book?
hi: आप कोई दिलचस्प किताब पढ़ रहें हैं क्या?

source: What time do you get up every day?
hi: आप रोज़ कितने बजे उठते हैं?

source: What time do you usually get up every morning?
hi: तुम आमतौर पर रोज़ सुबह कितने बजे उठते हो?

source: You've never seen a genuine diamond.
hi: तुमने असली हीरा कभी देखा ही नहीं है।

source: You look busy.
hi: व्यस्त लग रहे हो।

source: You may rely on him.
hi: तुम उसपर भरोसा कर सकते हो।

source: Who do you think he is?
hi: तुम्हारे ख़याल से वह कौन है?

source: Didn't you know that he passed away about two years ago?
hi: तुम्हें पता नहीं कि वे दो साल पहले ही गुज़र चुके थे?

source: Can you drive?
hi: तुम गाड़ी चला सकते हो क्या?

source: You should make good use of your time.
hi: तुम्हे अपने समय का ठीक से इस्तेमाल करना चाहिए।

source: Will you go with us?
hi: तुम हमारे साथ आओगे क्या?

source: Did you hear my son play the violin?
hi: क्या तुमने मेरे बेटे को वायोलिन बजाते हुए सुना है?

source: What did you do with my pants?
hi: तुमने मेरे पतलून के साथ क्या किया?

source: Did you see my camera?
hi: तुमने मेरा कैमरा देखा क्या?

source: I believe you like your job.
hi: मुझे लगता है कि तुम्हे तुम्हारा काम अच्छा लगता है।

source: Did you have a good sleep last night?
hi: तुम कल रात अच्छे से सोये क्या?

source: Did you study yesterday?
hi: क्या तुमने कल पढ़ाई की?

source: Have you read today's paper?
hi: आज का अख़बार पढ़ा क्या?

source: Do you like black cats?
hi: क्या आपको काली बिल्लियाँ पसंद हैं?

source: What do you want to do in the afternoon?
hi: तुम्हे दोपहर में क्या करने का मन है?

source: You have a good memory.
hi: तुम्हारी याददाश्त अच्छी है।

source: You are a very good artist.
hi: आप एक अच्छे कलाकार है

source: Are you interested in flowers?
hi: तुम्हें फूलों में दिलचस्पी है क्या?

source: Can you hear anything?
hi: कुछ सुनाई दे रहा है?

source: How many languages do you speak?
hi: आप कितनी भाषाएँ बोलते हैं?

source: Which do you like better, music or English?
hi: तुम्हें ज़्यादा क्या पसंद है, संगीत या अंग्रेज़ी?

source: Do you have a pencil?
hi: तुम्हारे पास पेनसिल है क्या?

source: Who were you waiting for at the station?
hi: तुम स्टेशन पर किसका इंतज़ार कर रहे थे?

source: You must endeavor to improve your English.
hi: तुम्हें अपनी अंग्रेज़ी सुधारने की कोशिश करनी चाहिए।

source: You aren't leaving Japan for good, are you?
hi: तुम हमेशा के लिए तो जापान नहीं जा रहे हो ना?

source: Did you hear the news on the radio?
hi: तुमने रेडियो पर खबर सुनी क्या?

source: It is time you should get up.
hi: तुम्हारे उठने का समय हो गया है।

source: Why do you talk about him as if he were an old man?
hi: तुम उसके बारे में ऐसे बात क्यों करते हो जैसे कि वह बूढ़ा आदमी हो?

source: Why did you come here this morning?
hi: तुम आज सुबह यहाँ क्यों आए?

source: Do you watch television?
hi: आप टीवी देखतें हैं क्या?

source: You should have kept it secret.
hi: तुम्हे इसे राज़ रखना चहिए था।

source: Were you told to do so?
hi: तुम्हें यह करने के लिए बताया गया था?

source: It is necessary for you to go there immediately.
hi: तुम्हारे लिए वहाँ तुरन्त जाना अनिवार्य है।
